ЛАБОРАТОРНАЯ РАБОТА 1
Цель: написание первой программы на языке С++,
знакомство с операциями над указателями;
знакомство с правилами передачи параметров в функцию


1. Ознакомиться со структурой программы на языке С++. Для этого
выполнить программу возведения числа 2 в степень. Модифицировать
программу так, чтобы вычислялась степень с любым основанием.

```cpp
#include <iostream>
using namespace std;

void main (void)
{
    int i, k;
    int power (int, int);
    for (1-0; i<10; i++)
    {
        k = power(2, i);
        cout<<"i = "<<i<<", k = "<<k<<endl;
    }
}
    
int power (int x, int n)
{
    int p=1;
    for(int i=1; i<n; i++) 
        p*=x;
    return p;
}
```


2. Выполнить программу, иллюстрирующую разные операции с
указателями. Повторить эксперимент для разных типов данных.

```cpp
#define PR(x) printf("x=%u, *x=%d, &x=%u\n",x,*x,&x)
#include <stdio.h>

void main (void)
{
    int mas[]={100, 200, 300};
    int *ptrl, *ptr2;
    ptr1=mas;
    ptr2=&mas[2];
    PR(ptrl);
    ptrl++;
    PR(ptrl);
    PR(ptr2);
    ++ptr2;
    printf("ptr2-ptr1=%u\n",ptr2-ptr1);
}
```


3. Написать программу, которая меняет местами значения двух
переменных. В качестве параметра использовать int, int* и int&.
Структура программы следующая: функция main() вводит
переменные и вызывает другую функцию, которая и выполняет обмен:

```cpp
#include <iostream.h>
void main (void)
{
    int a=2, b=5;
    void obmenl (int, int)
    void obmen2 (int*, int*);
    void obmen3 (int&, int&);
    cout << "до обмена: a= "<< а <<"b="<<b<< endl;
    //вызов obmen1 (int, int);
    cout << "после обмена 1: a= "<< a <<"b="<<b<< endl;
    // вызов obmen2 (int*, int);
    cout << "после обмена 2: a=
    // вызов obmen3 (int&, int&);
    "<< a <<"b="<<b<< endl;
    cout << "после обмена 3: a= "<< а <<"b="<<b<< endl;
}
```
Написать 3 варианта функции обмена. В качестве параметров эта
функция в первый раз получает два параметра типа int, второй раз - типа
int, третий раз типа int&. Придумайте способ достижения результата в
каждом из трех вариантов.