## Лабораторная работа 4

**Тема:** Приобретение навыков обработки строковых данных.

### Цель работы

Приобрести навыки обработки строковых данных на языке C++, познакомиться с библиотечными функциями работы со строками и реализовать собственные варианты основных операций над строками.

### Задание

1. Познакомиться с библиотечными функциями работы со строками.  
   Написать программу, которая использует следующие функции стандартной библиотеки (для работы с ними подключить файл `string.h`):

   - `strlen()` – определение длины строки;  
   - `strcat()` – конкатенация (сцепление) строк;  
   - `strcpy()` – копирование строк;  
   - `strcmp()` – сравнение строк.

2. Написать свои варианты функций:

   - определения длины строки (выполнить работу **тремя способами**);  
   - копирования строк;  
   - сравнения строк;  
   - конкатенации строк.

   Структура программы следующая: функция `main()` объявляет строки и вызывает другие функции, которые выполняют работу с переданными им параметрами. Пример общей структуры:

   ```cpp
   #include <iostream.h>

   void main(void)
   {
       char str1[] = "qwerty", str2[] = "1234567890";
       int dlina1(char*);
       int dlina2(char*);
       int dlina3(char*);
       void kopir(char*, char*);
       void sravn(char*, char*);
       void konkat(char*, char*);

       // использование функций длины строки
       cout << "длина str1 = " << dlina1(str1) << ", str2 = ";
       cout << dlina1(str2) << endl;

       cout << "длина str1 = " << dlina2(str1) << ", str2 = ";
       cout << dlina2(str2) << endl;

       cout << "длина str1 = " << dlina3(str1) << ", str2 = ";
       cout << dlina3(str2) << endl;

       // вызов kopir(char*, char*)
       // вывод результата копирования

       // вызов sravn(char*, char*)
       // вывод результата сравнения

       // вызов konkat(char*, char*)
       // вывод результата сцепления
   }
   ```

   3. Переписать функции так, чтобы они использовали динамическую память при задании строк:

```cpp
#include <iostream.h>
#include <alloc.h>

void main(void)
{
    char *str1, *str2;
    str1 = (char*)malloc(100);
    str2 = (char*)malloc(100);

    // работа со строками str1 и str2 с использованием ранее написанных функций

    free(str1);
    free(str2);
}
```

4. Изменить программу так, чтобы вместо malloc() использовалась функция calloc().
В отчёте описать, в чём сходство и различие этих функций.

5. В следующей программе организовать массив строк.
Применить функции, написанные в предыдущем пункте, к строкам, составляющим этот массив (определение длины, копирование, сравнение, конкатенация и т.п.).


### Ответы на вопросы

Описать, в чём сходство и различие этих функций. (malloc и calloc)

malloc и calloc обе выделяют динамическую память в куче и возвращают указатель на первый байт выделенного блока, либо NULL при ошибке.

**Сходство**
- Обе функции находятся в стандартной библиотеке С (stdlib.h / alloc.h в старых компиляторах).
- Обе выделяют непрерывный блок памяти в куче.
- Память, полученную через обе функции, нужно освобождать free(ptr).

**Отличия**
1. Инициализация памяти
- malloc(size) выделяет неинициализированную память; её содержимое не определено (могут быть «мусорные» значения).
- calloc(n, size) не только выделяет память под n * size байт, но и заполняет её нулями (для char — '\0', для int — все биты 0, что обычно даёт 0).

2. Параметры
- void* malloc(size_t size); — один параметр: общий размер в байтах.
- void* calloc(size_t n, size_t size); — два параметра: количество элементов и размер одного элемента; общий размер равен n * size.

3. Типичные случаи использования
- malloc удобно использовать, когда уже известен общий размер блока в байтах.
- calloc удобно использовать для массивов структур/элементов, когда нужно сразу получить обнулённую память (например, для строк — чтобы сразу были '\0').
